#include <stdio.h>                  // Library for input and output functions (header)

int main() {                        //แสดงโปรแกรมหลัก
    // บรรทัดที่ 1
    printf("a= 0.617%%\n");         // พิมพ์ข้อความ a= 0.617%

    // บรรทัดที่ 2
    printf("b=  25%%\n");           // พิมพ์ข้อความ b= 25%

    // บรรทัดที่ 3
    printf("c =19.000%%\n");        // พิมพ์ข้อความ c =19.000%

    // บรรทัดที่ 4
    printf("d  =9 %%\n");           // พิมพ์ข้อความ d  =9 %

    // บรรทัดที่ 5
    printf("e=124.555%%\n");        // พิมพ์ข้อความ e=124.555%

    // บรรทัดที่ 6
    printf("f=0.001%%\n");          // พิมพ์ข้อความ f=0.001%

    return 0;                       // จบโปรแกรมหลัก
}