#include <stdio.h>                                          // กำหนดการใช้งานไลบรารีมาตรฐานสำหรับการพิมพ์ข้อมูล

int main() {                                                // ฟังก์ชันหลักของโปรแกรม
    char name = 'S';                                        // กำหนดตัวแปรชนิดตัวอักษรสำหรับเก็บชื่อ S
    int age = 19;                                           // กำหนดตัวแปรชนิดจำนวนเต็มสำหรับเก็บอายุ 63.5
    float weighs = 63.5;                                    // กำหนดตัวแปรชนิดจำนวนทศนิยมสำหรับเก็บน้ำหนัก 63.5

    printf("Student %c is %d years old.\n", name , age);    // พิมพ์ข้อมูลชื่อและอายุของนักเรียน
    printf("His weighs is %.1f kg.\n", weighs);             // พิมพ์ข้อมูลน้ำหนักของนักเรียน ทศนิยม 1 ตำแหน่ง

    return 0;                                               // จบการทำงานของโปรแกรมหลัก
}